benchmarks/cospec_benchmark_results_20250522_175512_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/baseline_0_0_4_sharegpt_output.txt
INFO 05-22 18:01:36 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=4.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Temperature:  0.0
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 4.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     952       
Benchmark duration (s):                  300.41    
Total input tokens:                      203281    
Total generated tokens:                  337807    
Request throughput (req/s):              3.17      
Output token throughput (tok/s):         1124.50   
Total Token throughput (tok/s):          1801.19   
---------------Time to First Token----------------
Mean TTFT (ms):                          12873.67  
Median TTFT (ms):                        12112.61  
P99 TTFT (ms):                           35185.83  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          74.29     
Median TPOT (ms):                        78.21     
P99 TPOT (ms):                           102.55    
---------------Inter-token Latency----------------
Mean ITL (ms):                           74.22     
Median ITL (ms):                         69.16     
P99 ITL (ms):                            192.45    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          39117.21  
Median E2EL (ms):                        37690.41  
P99 E2EL (ms):                           114383.16 
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 140.61    
Median Token Latency (ms):               108.02    
P99 Token Latency (ms):                  506.47    
==================================================